anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
                <register derivedFrom="PRI1">
                    <name>PRI11</name>
                    <displayName>PRI11</displayName>
                    <description>11th Interrupt Priority Register</description>
                    <addressOffset>0x0000002C</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI12</name>
                    <displayName>PRI12</displayName>
                    <description>12th Interrupt Priority Register</description>
                    <addressOffset>0x00000030</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI13</name>
                    <displayName>PRI13</displayName>
                    <description>13th Interrupt Priority Register</description>
                    <addressOffset>0x00000034</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI14</name>
                    <displayName>PRI14</displayName>
                    <description>14th Interrupt Priority Register</description>
                    <addressOffset>0x00000038</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI15</name>
                    <displayName>PRI15</displayName>
                    <description>15th Interrupt Priority Register</description>
                    <addressOffset>0x0000003C</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI16</name>
                    <displayName>PRI16</displayName>
                    <description>16th Interrupt Priority Register</description>
                    <addressOffset>0x00000040</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI17</name>
                    <displayName>PRI17</displayName>
                    <description>17th Interrupt Priority Register</description>
                    <addressOffset>0x00000044</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI18</name>
                    <displayName>PRI18</displayName>
                    <description>18th Interrupt Priority Register</description>
                    <addressOffset>0x00000048</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI19</name>
                    <displayName>PRI19</displayName>
                    <description>19th Interrupt Priority Register</description>
                    <addressOffset>0x0000004C</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI20</name>
                    <displayName>PRI20</displayName>
                    <description>20th Interrupt Priority Register</description>
                    <addressOffset>0x00000050</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI21</name>
                    <displayName>PRI21</displayName>
                    <description>21st Interrupt Priority Register</description>
                    <addressOffset>0x00000054</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI22</name>
                    <displayName>PRI22</displayName>
                    <description>22nd Interrupt Priority Register</description>
                    <addressOffset>0x00000058</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI23</name>
                    <displayName>PRI23</displayName>
                    <description>23rd Interrupt Priority Register</description>
                    <addressOffset>0x0000005C</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI24</name>
                    <displayName>PRI24</displayName>
                    <description>24th Interrupt Priority Register</description>
                    <addressOffset>0x00000060</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI25</name>
                    <displayName>PRI25</displayName>
                    <description>25th Interrupt Priority Register</description>
                    <addressOffset>0x00000064</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI26</name>
                    <displayName>PRI26</displayName>
                    <description>26th Interrupt Priority Register</description>
                    <addressOffset>0x00000068</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI27</name>
                    <displayName>PRI27</displayName>
                    <description>27th Interrupt Priority Register</description>
                    <addressOffset>0x0000006C</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI28</name>
                    <displayName>PRI28</displayName>
                    <description>28th Interrupt Priority Register</description>
                    <addressOffset>0x00000070</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI29</name>
                    <displayName>PRI29</displayName>
                    <description>29th Interrupt Priority Register</description>
                    <addressOffset>0x00000074</addressOffset>
                </register>
                <register derivedFrom="PRI1">
                    <name>PRI30</name>
                    <displayName>PRI30</displayName>
                    <description>30th Interrupt Priority Register</description>
                    <addressOffset>0x00000078</addressOffset>
                </register>
