anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART2</name>
            <description>UART2 Controller</description>
            <groupName>UART2</groupName>
            <baseAddress>0x40010000</baseAddress>
            <interrupt>
                <name>UART2_IRQ</name>
                <value>2</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART3</name>
            <description>UART3 Controller</description>
            <groupName>UART3</groupName>
            <baseAddress>0x40038000</baseAddress>
            <interrupt>
                <name>UART3_IRQ</name>
                <value>23</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART4</name>
            <description>UART4 Controller</description>
            <groupName>UART4</groupName>
            <baseAddress>0x400E8000</baseAddress>
            <interrupt>
                <name>UART4_IRQ</name>
                <value>28</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>FLASH_CNTRL</name>
            <description>FLASH Memory Controller</description>
            <groupName>FLASH_CNTRL</groupName>
            <baseAddress>0x40018000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CMD</name>
                    <displayName>CMD</displayName>
                    <description>Control Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CON</name>
                            <description>Switching the FLASH memory controller to register control</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Delay</name>
                            <description>Program memory delay when reading in cycles (in working mode)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>XE</name>
                            <description>Output address ADR[17:9]</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>YE</name>
                            <description>Output address ADR[8:2]</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>Reading amplifier</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IFREN</name>
                            <description>Main/information block selection</description>
                            <bitOffset>9</bitOffset>
                        </field>
                        <field>
                            <name>ERASE</name>
                            <description>Erase 4 KB memory page</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MAS1</name>
                            <description>Erase the entire block when ERASE = 1</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PROG</name>
                            <description>Write data from the DI register</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NVSTR</name>
                            <description>Write or erase operations</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR</name>
                            <description>Reset FLASH test mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADR</name>
                    <displayName>ADR</displayName>
                    <description>Address Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>YADR</name>
                            <description>Word address</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>XADR</name>
                            <description>Main: XADR[8:3] - page address, XADR[2:0] - row address.
                                         Info: XADR[3] - page address, XADR[2:0] - row address</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DI</name>
                    <displayName>DI</displayName>
                    <description>Write Data Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>DO</name>
                    <displayName>DO</displayName>
                    <description>Read Data Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>Key register, 0x8AAA5551 unlocks access</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
