anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
                <register>
                    <name>TIM_CLOCK</name>
                    <displayName>TIM_CLOCK</displayName>
                    <description>TIM_CLOCK description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TIM1_BRG</name>
                            <description>TIM1_BRG description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIM2_BRG</name>
                            <description>TIM2_BRG description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIM3_BRG</name>
                            <description>TIM3_BRG description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIM4_BRG</name>
                            <description>TIM4_BRG description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIM1_CLK_EN</name>
                            <description>TIM1_CLK_EN description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM2_CLK_EN</name>
                            <description>TIM2_CLK_EN description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3_CLK_EN</name>
                            <description>TIM3_CLK_EN description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM4_CLK_EN</name>
                            <description>TIM4_CLK_EN description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_CLOCK</name>
                    <displayName>UART_CLOCK</displayName>
                    <description>UART_CLOCK description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>UART1_BRG</name>
                            <description>UART1_BRG description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART2_BRG</name>
                            <description>UART2_BRG description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART3_BRG</name>
                            <description>UART3_BRG description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART1_CLK_EN</name>
                            <description>UART1_CLK_EN description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART2_CLK_EN</name>
                            <description>UART2_CLK_EN description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART3_CLK_EN</name>
                            <description>UART3_CLK_EN description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART4_BRG</name>
                            <description>UART4_BRG description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART4_CLK_EN</name>
                            <description>UART4_CLK_EN description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSP_CLOCK</name>
                    <displayName>SSP_CLOCK</displayName>
                    <description>SSP_CLOCK description</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SSP1_BRG</name>
                            <description>SSP1_BRG description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SSP2_BRG</name>
                            <description>SSP2_BRG description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SSP3_BRG</name>
                            <description>SSP3_BRG description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SSP1_CLK_EN</name>
                            <description>SSP1_CLK_EN description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSP2_CLK_EN</name>
                            <description>SSP2_CLK_EN description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSP3_CLK_EN</name>
                            <description>SSP3_CLK_EN description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
