anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>POWER</name>
            <description>POWER description</description>
            <groupName>POWER</groupName>
            <baseAddress>0x40058000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>POWER_IRQ</name>
                <value>4</value>
            </interrupt>
            <registers>
                <register>
                    <name>PVDCS</name>
                    <displayName>PVDCS</displayName>
                    <description>PVDCS description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PVDBEN</name>
                            <description>PVDBEN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVDEN</name>
                            <description>PVDEN description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLSB</name>
                            <description>PLSB description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>PLS</name>
                            <description>PLS description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>PVDB</name>
                            <description>PVDB description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVD</name>
                            <description>PVD description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IEPVDB</name>
                            <description>IEPVDB description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IEPVD</name>
                            <description>IEPVD description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>INV description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INVB</name>
                            <description>INVB description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>BKP</name>
            <description>BKP description</description>
            <groupName>BKP</groupName>
            <baseAddress>0x40060000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>BKP_IRQ</name>
                <value>10</value>
            </interrupt>
            <registers>
                <register>
                    <name>WPR</name>
                    <displayName>WPR</displayName>
                    <description>WPR description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>LDO</name>
                    <displayName>LDO</displayName>
                    <description>LDO description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BLDO_TRIM</name>
                            <description>BLDO_TRIM description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLDO_BOOST</name>
                            <description>BLDO_BOOST description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LDO_BOOST</name>
                            <description>LDO_BOOST description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SW_CNTRL</name>
                            <description>SW_CNTRL description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JTAG_ON</name>
                            <description>JTAG_ON description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAKEUP1</name>
                            <description>WAKEUP1 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WAKEUP2</name>
                            <description>WAKEUP2 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WAKEUP3</name>
                            <description>WAKEUP3 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FPOR</name>
                            <description>FPOR description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPF</name>
                            <description>TAMPF description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>MODE description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SW_OFF</name>
                            <description>SW_OFF description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK</name>
                    <displayName>CLK</displayName>
                    <description>CLK description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LSE_ON</name>
                            <description>LSE_ON description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSE_BYP</name>
                            <description>LSE_BYP description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSE_RDY</name>
                            <description>LSE_RDY description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSE_CONF</name>
                            <description>LSE_CONF description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>LSI_ON</name>
                            <description>LSI_ON description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSI_RDY</name>
                            <description>LSI_RDY description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSI_ON</name>
                            <description>HSI_ON description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSI_RDY</name>
                            <description>HSI_RDY description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSI_LSI_TRIM</name>
                            <description>HSI_LSI_TRIM description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CR</name>
                    <displayName>RTC_CR</displayName>
                    <description>RTC_CR description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RTC_SEL</name>
                            <description>RTC_SEL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTC_EN</name>
                            <description>RTC_EN description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CAL</name>
                            <description>RTC_CAL description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RTC_RESET</name>
                            <description>RTC_RESET description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUCK_SEL[1:0]</name>
                            <description>WUCK_SEL[1:0] description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WUCK_SEL[2]</name>
                            <description>WUCK_SEL[2] description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMT</name>
                            <description>FMT description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_WUTR</name>
                    <displayName>RTC_WUTR</displayName>
                    <description>RTC_WUTR description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RTC_PREDIV_S</name>
                    <displayName>RTC_PREDIV_S</displayName>
                    <description>RTC_PREDIV_S description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RTC_DIV</name>
                            <description>RTC_DIV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_PRL</name>
                    <displayName>RTC_PRL</displayName>
                    <description>RTC_PRL description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RTC_PRL</name>
                            <description>RTC_PRL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_ALRM</name>
                    <displayName>RTC_ALRM</displayName>
                    <description>RTC_ALRM description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RTC_CS</name>
                    <displayName>RTC_CS</displayName>
                    <description>RTC_CS description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>OWF</name>
                            <description>OWF description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SECF</name>
                            <description>SECF description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUTF</name>
                            <description>WUTF description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OWF_IE</name>
                            <description>OWF_IE description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SECF_IE</name>
                            <description>SECF_IE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUTF_IE</name>
                            <description>WUTF_IE description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WEC</name>
                            <description>WEC description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ALRA_EN</name>
                            <description>ALRA_EN description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRB_EN</name>
                            <description>ALRB_EN description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRAF</name>
                            <description>ALRAF description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRBF</name>
                            <description>ALRBF description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRAF_IE</name>
                            <description>ALRAF_IE description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRBF_IE</name>
                            <description>ALRBF_IE description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSF</name>
                            <description>TSF description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_TR</name>
                    <displayName>RTC_TR</displayName>
                    <description>RTC_TR description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SU</name>
                            <description>SU description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>ST description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MNU</name>
                            <description>MNU description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MNT</name>
                            <description>MNT description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>HU</name>
                            <description>HU description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HT</name>
                            <description>HT description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>PM description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
