anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
                <register derivedFrom="RTC_DR">
                    <name>RTC_TSDR1</name>
                    <displayName>RTC_TSDR1</displayName>
                    <description>RTC_TSDR1 description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <access>read-only</access>
                </register>
                <register derivedFrom="RTC_DR">
                    <name>RTC_TSDR2</name>
                    <displayName>RTC_TSDR2</displayName>
                    <description>RTC_TSDR2 description</description>
                    <addressOffset>0x00000044</addressOffset>
                    <access>read-only</access>
                </register>
                <register derivedFrom="RTC_DR">
                    <name>RTC_TSDR3</name>
                    <displayName>RTC_TSDR3</displayName>
                    <description>RTC_TSDR3 description</description>
                    <addressOffset>0x00000048</addressOffset>
                    <access>read-only</access>
                </register>
                <register>
                    <name>RTC_TAFCR</name>
                    <displayName>RTC_TAFCR</displayName>
                    <description>RTC_TAFCR description</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TAMP_EN</name>
                            <description>TAMP_EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_TRG[0]</name>
                            <description>TAMP_TRG[0] description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_TRG[1]</name>
                            <description>TAMP_TRG[1] description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_TRG[2]</name>
                            <description>TAMP_TRG[2] description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_IE</name>
                            <description>TAMP_IE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_EN</name>
                            <description>TS_EN description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_EDGE[0]</name>
                            <description>TS_EDGE[0] description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_EDGE[1]</name>
                            <description>TS_EDGE[1] description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_EDGE[2]</name>
                            <description>TS_EDGE[2] description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_IE</name>
                            <description>TS_IE description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_IN_SEL[0]</name>
                            <description>TAMP_IN_SEL[0] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TAMP_IN_SEL[1]</name>
                            <description>TAMP_IN_SEL[1] description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TAMP_IN_SEL[2]</name>
                            <description>TAMP_IN_SEL[2] description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TS_IN_SEL[0]</name>
                            <description>TS_IN_SEL[0] description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TS_IN_SEL[1]</name>
                            <description>TS_IN_SEL[1] description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TS_IN_SEL[2]</name>
                            <description>TS_IN_SEL[2] description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
