anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>TIMER1</name>
            <description>TIMER1 description</description>
            <groupName>TIMER1</groupName>
            <baseAddress>0x40070000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TIMER1_IRQ</name>
                <value>6</value>
            </interrupt>
            <registers>
                <register>
                    <name>CNT</name>
                    <displayName>CNT</displayName>
                    <description>CNT description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>PSG</name>
                    <displayName>PSG</displayName>
                    <description>PSG description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                </register>
                <register>
                    <name>ARR</name>
                    <displayName>ARR</displayName>
                    <description>ARR description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CNTRL</name>
                    <displayName>CNTRL</displayName>
                    <description>CNTRL description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_EN</name>
                            <description>CNT_EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARRB_EN</name>
                            <description>ARRB_EN description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WR_CMPL</name>
                            <description>WR_CMPL description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DIR</name>
                            <description>DIR description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FDTS</name>
                            <description>FDTS description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CNT_MODE</name>
                            <description>CNT_MODE description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EVNT_SEL</name>
                            <description>EVNT_SEL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1_CCR</name>
                    <displayName>CH1_CCR</displayName>
                    <description>CH1_CCR description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH2_CCR</name>
                    <displayName>CH2_CCR</displayName>
                    <description>CH2_CCR description</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH3_CCR</name>
                    <displayName>CH3_CCR</displayName>
                    <description>CH3_CCR description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH4_CCR</name>
                    <displayName>CH4_CCR</displayName>
                    <description>CH4_CCR description</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH1_CNTRL0</name>
                    <displayName>CH1_CNTRL0</displayName>
                    <description>CH1_CNTRL0 description</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CH_FLTR</name>
                            <description>CH_FLTR description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CH_SEL</name>
                            <description>CH_SEL description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH_PSC</name>
                            <description>CH_PSC description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OCCE</name>
                            <description>OCCE description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCCM</name>
                            <description>OCCM description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EN</name>
                            <description>BRK_EN description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_EN</name>
                            <description>ETR_EN description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WR_CMPL</name>
                            <description>WR_CMPL description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CAP_NPWM</name>
                            <description>CAP_NPWM description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WR_CMPL1</name>
                            <description>WR_CMPL1 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CH1_CNTRL0">
                    <name>CH2_CNTRL0</name>
                    <displayName>CH2_CNTRL0</displayName>
                    <description>CH2_CNTRL0 description</description>
                    <addressOffset>0x00000024</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL0">
                    <name>CH3_CNTRL0</name>
                    <displayName>CH3_CNTRL0</displayName>
                    <description>CH3_CNTRL0 description</description>
                    <addressOffset>0x00000028</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL0">
                    <name>CH4_CNTRL0</name>
                    <displayName>CH4_CNTRL0</displayName>
                    <description>CH4_CNTRL0 description</description>
                    <addressOffset>0x0000002C</addressOffset>
                </register>
                <register>
                    <name>CH1_CNTRL1</name>
                    <displayName>CH1_CNTRL1</displayName>
                    <description>CH1_CNTRL1 description</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SELOE</name>
                            <description>SELOE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SELO</name>
                            <description>SELO description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>INV description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NSELOE</name>
                            <description>NSELOE description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>NSELO</name>
                            <description>NSELO description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>NINV</name>
                            <description>NINV description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CH1_CNTRL1">
                    <name>CH2_CNTRL1</name>
                    <displayName>CH2_CNTRL1</displayName>
                    <description>CH2_CNTRL1 description</description>
                    <addressOffset>0x00000034</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL1">
                    <name>CH3_CNTRL1</name>
                    <displayName>CH3_CNTRL1</displayName>
                    <description>CH3_CNTRL1 description</description>
                    <addressOffset>0x00000038</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL1">
                    <name>CH4_CNTRL1</name>
                    <displayName>CH4_CNTRL1</displayName>
                    <description>CH4_CNTRL1 description</description>
                    <addressOffset>0x0000003C</addressOffset>
                </register>
                <register>
                    <name>CH1_DTG</name>
                    <displayName>CH1_DTG</displayName>
                    <description>CH1_DTG description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DTGx</name>
                            <description>DTGx description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EDTS</name>
                            <description>EDTS description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTG</name>
                            <description>DTG description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CH1_DTG">
                    <name>CH2_DTG</name>
                    <displayName>CH2_DTG</displayName>
                    <description>CH2_DTG description</description>
                    <addressOffset>0x00000044</addressOffset>
                </register>
                <register derivedFrom="CH1_DTG">
                    <name>CH3_DTG</name>
                    <displayName>CH3_DTG</displayName>
                    <description>CH3_DTG description</description>
                    <addressOffset>0x00000048</addressOffset>
                </register>
                <register derivedFrom="CH1_DTG">
                    <name>CH4_DTG</name>
                    <displayName>CH4_DTG</displayName>
                    <description>CH4_DTG description</description>
                    <addressOffset>0x0000004C</addressOffset>
                </register>
                <register>
                    <name>BRKETR_CNTRL</name>
                    <displayName>BRKETR_CNTRL</displayName>
                    <description>BRKETR_CNTRL description</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BRK_INV</name>
                            <description>BRK_INV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_INV</name>
                            <description>ETR_INV description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_PSC</name>
                            <description>ETR_PSC description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ETR_FLTR</name>
                            <description>ETR_FLTR description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATUS</name>
                    <displayName>STATUS</displayName>
                    <description>STATUS description</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_ZERO_EVNT</name>
                            <description>CNT_ZERO_EVNT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNT_ARR_EVNT</name>
                            <description>CNT_ARR_EVNT description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_RE_EVNT</name>
                            <description>ETR_RE_EVNT description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_FE_EVNT</name>
                            <description>ETR_FE_EVNT description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EVNT</name>
                            <description>BRK_EVNT description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT[0]</name>
                            <description>CCR_CAP_EVNT[0] description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT[1]</name>
                            <description>CCR_CAP_EVNT[1] description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT[2]</name>
                            <description>CCR_CAP_EVNT[2] description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT[3]</name>
                            <description>CCR_CAP_EVNT[3] description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT[0]</name>
                            <description>CCR_REF_EVNT[0] description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT[1]</name>
                            <description>CCR_REF_EVNT[1] description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT[2]</name>
                            <description>CCR_REF_EVNT[2] description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT[3]</name>
                            <description>CCR_REF_EVNT[3] description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT[0]</name>
                            <description>CCR_CAP1_EVNT[0] description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT[1]</name>
                            <description>CCR_CAP1_EVNT[1] description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT[2]</name>
                            <description>CCR_CAP1_EVNT[2] description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT[3]</name>
                            <description>CCR_CAP1_EVNT[3] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
