anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
                <register>
                    <name>IE</name>
                    <displayName>IE</displayName>
                    <description>IE description</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_ZERO_EVNT_IE</name>
                            <description>CNT_ZERO_EVNT_IE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNT_ARR_EVNT_IE</name>
                            <description>CNT_ARR_EVNT_IE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_RE_EVNT_IE</name>
                            <description>ETR_RE_EVNT_IE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_FE_EVNT_IE</name>
                            <description>ETR_FE_EVNT_IE description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EVNT_IE</name>
                            <description>BRK_EVNT_IE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_IE[0]</name>
                            <description>CCR_CAP_EVNT_IE[0] description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_IE[1]</name>
                            <description>CCR_CAP_EVNT_IE[1] description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_IE[2]</name>
                            <description>CCR_CAP_EVNT_IE[2] description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_IE[3]</name>
                            <description>CCR_CAP_EVNT_IE[3] description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        
                        <field>
                            <name>CCR_REF_EVNT_IE[0]</name>
                            <description>CCR_REF_EVNT_IE[0] description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_IE[1]</name>
                            <description>CCR_REF_EVNT_IE[1] description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_IE[2]</name>
                            <description>CCR_REF_EVNT_IE[2] description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_IE[3]</name>
                            <description>CCR_REF_EVNT_IE[3] description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_IE[0]</name>
                            <description>CCR_CAP1_EVNT_IE[0] description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_IE[1]</name>
                            <description>CCR_CAP1_EVNT_IE[1] description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_IE[2]</name>
                            <description>CCR_CAP1_EVNT_IE[2] description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_IE[3]</name>
                            <description>CCR_CAP1_EVNT_IE[3] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_RE</name>
                    <displayName>DMA_RE</displayName>
                    <description>DMA_RE description</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_ZERO_EVNT_RE</name>
                            <description>CNT_ZERO_EVNT_RE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNT_ARR_EVNT_RE</name>
                            <description>CNT_ARR_EVNT_RE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_RE_EVNT_RE</name>
                            <description>ETR_RE_EVNT_RE description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_FE_EVNT_RE</name>
                            <description>ETR_FE_EVNT_RE description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EVNT_RE</name>
                            <description>BRK_EVNT_RE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_RE[0]</name>
                            <description>CCR_CAP_EVNT_RE[0] description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_RE[1]</name>
                            <description>CCR_CAP_EVNT_RE[1] description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_RE[2]</name>
                            <description>CCR_CAP_EVNT_RE[2] description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_RE[3]</name>
                            <description>CCR_CAP_EVNT_RE[3] description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_RE[0]</name>
                            <description>CCR_REF_EVNT_RE[0] description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_RE[1]</name>
                            <description>CCR_REF_EVNT_RE[1] description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_RE[2]</name>
                            <description>CCR_REF_EVNT_RE[2] description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_RE[3]</name>
                            <description>CCR_REF_EVNT_RE[3] description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_RE[0]</name>
                            <description>CCR_CAP1_EVNT_RE[0] description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_RE[1]</name>
                            <description>CCR_CAP1_EVNT_RE[1] description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_RE[2]</name>
                            <description>CCR_CAP1_EVNT_RE[2] description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_RE[3]</name>
                            <description>CCR_CAP1_EVNT_RE[3] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1_CNTRL2</name>
                    <displayName>CH1_CNTRL2</displayName>
                    <description>CH1_CNTRL2 description</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CH_SEL1</name>
                            <description>CH_SEL1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CCR1_EN</name>
                            <description>CCR1_EN description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_RLD</name>
                            <description>CCR_RLD description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVNT_DLY</name>
                            <description>EVNT_DLY description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
