anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
                <register>
                    <name>PWR</name>
                    <displayName>PWR</displayName>
                    <description>PWR description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PIN0</name>
                            <description>PIN0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN1</name>
                            <description>PIN1 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN2</name>
                            <description>PIN2 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN3</name>
                            <description>PIN3 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN4</name>
                            <description>PIN4 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN5</name>
                            <description>PIN5 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN6</name>
                            <description>PIN6 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN7</name>
                            <description>PIN7 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN8</name>
                            <description>PIN8 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN9</name>
                            <description>PIN9 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN10</name>
                            <description>PIN10 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN11</name>
                            <description>PIN11 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN12</name>
                            <description>PIN12 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN13</name>
                            <description>PIN13 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN14</name>
                            <description>PIN14 description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN15</name>
                            <description>PIN15 description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="RXTX">
                    <name>SETTX</name>
                    <displayName>SETTX</displayName>
                    <description>SETTX description</description>
                    <addressOffset>0x00000020</addressOffset>
                </register>
                <register>
                    <name>CLRTX</name>
                    <displayName>CLRTX</displayName>
                    <description>CLRTX description</description>
                    <addressOffset>0x00000024</addressOffset>
                </register>
                <register derivedFrom="RXTX">
                    <name>RDTX</name>
                    <displayName>RDTX</displayName>
                    <description>RDTX description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <access>read-only</access>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="PORTA">
            <name>PORTB</name>
            <description>PORTB description</description>
            <groupName>PORTB</groupName>
            <baseAddress>0x40088000</baseAddress>
            <interrupt>
                <name>EXT_INT2_IRQ</name>
                <value>12</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="PORTA">
            <name>PORTC</name>
            <description>PORTC description</description>
            <groupName>PORTC</groupName>
            <baseAddress>0x40090000</baseAddress>
            <interrupt>
                <name>EXT_INT3_IRQ</name>
                <value>13</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="PORTA">
            <name>PORTD</name>
            <description>PORTD description</description>
            <groupName>PORTD</groupName>
            <baseAddress>0x400F0000</baseAddress>
        </peripheral>
        <peripheral>
            <name>CRC</name>
            <description>CRC description</description>
            <groupName>CRC</groupName>
            <baseAddress>0x40098000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>CTRL description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CRCEN</name>
                            <description>CRCEN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DATAINV</name>
                            <description>DATAINV description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMAEN description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DLSIZE</name>
                            <description>DLSIZE description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DCSIZE</name>
                            <description>DCSIZE description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>STAT description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CONVCOMP</name>
                            <description>CONVCOMP description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFOFULL</name>
                            <description>FIFOFULL description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFOEMPTY</name>
                            <description>FIFOEMPTY description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FIFOOVER</name>
                            <description>FIFOOVER description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATAI</name>
                    <displayName>DATAI</displayName>
                    <description>DATAI description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>DATA_IN</name>
                            <description>DATA_IN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VAL</name>
                    <displayName>VAL</displayName>
                    <description>VAL description</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CRCOUT</name>
                            <description>CRCOUT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POL</name>
                    <displayName>POL</displayName>
                    <description>POL description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CRC_POL</name>
                            <description>CRC_POL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                    </fields>
                </register>
