anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SENSORS</name>
            <description>SENSORS description</description>
            <groupName>SENSORS</groupName>
            <baseAddress>0x400A8000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SENSORS_IRQ</name>
                <value>19</value>
            </interrupt>
            <registers>
                <register>
                    <name>STATE_REG</name>
                    <displayName>STATE_REG</displayName>
                    <description>Sensor Signal Status Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>MESH_ACTIVE_ALARM</name>
                            <description>MESH_ACTIVE_ALARM description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMFI3</name>
                            <description>EMFI3 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMFI2</name>
                            <description>EMFI2 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMFI1</name>
                            <description>EMFI1 description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LIGHT</name>
                            <description>LIGHT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="STATE_REG">
                    <name>REAL_TIME</name>
                    <displayName>REAL_TIME</displayName>
                    <description>Sensor Input Status Monitoring Register</description>
                    <addressOffset>0x00000004</addressOffset>
                </register>
                <register derivedFrom="STATE_REG">
                    <name>INT_MASK</name>
                    <displayName>INT_MASK</displayName>
                    <description>Interrupt Request Mask Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <access>read-writeOnce</access>
                </register>
                <register derivedFrom="STATE_REG">
                    <name>K_RES_MASK</name>
                    <displayName>K_RES_MASK</displayName>
                    <description>Reset Request Mask Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <access>read-writeOnce</access>
                </register>
                <register derivedFrom="STATE_REG">
                    <name>ENABLE</name>
                    <displayName>ENABLE</displayName>
                    <description>Sensor Enable Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <access>read-writeOnce</access>
                </register>
                <register>
                    <name>MESH_KEY7</name>
                    <displayName>MESH_KEY7</displayName>
                    <description>Active Mesh Key Register 0 (bits 255:224)</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MESH_KEY6</name>
                    <displayName>MESH_KEY6</displayName>
                    <description>Active Mesh Key Register 1 (bits 223:192)</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MESH_KEY5</name>
                    <displayName>MESH_KEY5</displayName>
                    <description>Active Mesh Key Register 2 (bits 191:160)</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MESH_KEY4</name>
                    <displayName>MESH_KEY4</displayName>
                    <description>Active Mesh Key Register 3 (bits 159:128)</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MESH_KEY3</name>
                    <displayName>MESH_KEY3</displayName>
                    <description>Active Mesh Key Register 4 (bits 127:96)</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MESH_KEY2</name>
                    <displayName>MESH_KEY2</displayName>
                    <description>Active Mesh Key Register 5 (bits 95:64)</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MESH_KEY1</name>
                    <displayName>MESH_KEY1</displayName>
                    <description>Active Mesh Key Register 6 (bits 63:32)</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MESH_KEY0</name>
                    <displayName>MESH_KEY0</displayName>
                    <description>Active Mesh Key Register 7 (bits 31:0)</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MESH_INIT1</name>
                    <displayName>MESH_INIT1</displayName>
                    <description>Active Mesh Init Register 0 (bits 63:32)</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MESH_INIT0</name>
                    <displayName>MESH_INIT0</displayName>
                    <description>Active Mesh Init Register 1 (bits 31:0)</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MESHCNTR</name>
                    <displayName>MESHCNTR</displayName>
                    <description>Active Mesh Control Register</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <access>read-writeOnce</access>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>DIV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
