anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RANDOM</name>
            <description>RANDOM description</description>
            <groupName>RANDOM</groupName>
            <baseAddress>0x400B8000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RANDOM_IRQ</name>
                <value>21</value>
            </interrupt>
            <registers>
                <register>
                    <name>STAT_CTRL_REG</name>
                    <displayName>STAT_CTRL_REG</displayName>
                    <description>Status and Control Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EN_STATE</name>
                            <description>EN_STATE description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>BUSY description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UNREAD_DATA</name>
                            <description>UNREAD_DATA description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MASK_GEN0</name>
                            <description>MASK_GEN0 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MASK_GEN1</name>
                            <description>MASK_GEN1 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WORK_MODE</name>
                            <description>WORK_MODE description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BIT_CN</name>
                            <description>BIT_CN description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_CTRL_REG</name>
                    <displayName>INT_CTRL_REG</displayName>
                    <description>Interrupt Control Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>INT_EN</name>
                            <description>INT_EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UNREAD_DATA</name>
                            <description>UNREAD_DATA description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_DIV_REG</name>
                    <displayName>CLK_DIV_REG</displayName>
                    <description>Clock Divider Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>DIV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PAUSE_REG</name>
                    <displayName>PAUSE_REG</displayName>
                    <description>Pause Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>OUTPUT_REG</name>
                    <displayName>OUTPUT_REG</displayName>
                    <description>Output Random Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>PAUSE_CNT_REG</name>
                    <displayName>PAUSE_CNT_REG</displayName>
                    <description>Pause Counter Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>TEMP_REG</name>
                    <displayName>TEMP_REG</displayName>
                    <description>Temp Random Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
