anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>L_BLOCK</name>
            <description>L_BLOCK description</description>
            <groupName>L_BLOCK</groupName>
            <baseAddress>0x60004000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>L_BLOCK_IRQ</name>
                <value>22</value>
            </interrupt>
            <registers>
                <register>
                    <name>TRANSFORM_0</name>
                    <displayName>TRANSFORM_0</displayName>
                    <description>Transformation Register 1</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_1</name>
                    <displayName>TRANSFORM_1</displayName>
                    <description>Transformation Register 2</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_2</name>
                    <displayName>TRANSFORM_2</displayName>
                    <description>Transformation Register 3</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_3</name>
                    <displayName>TRANSFORM_3</displayName>
                    <description>Transformation Register 4</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TABLE_CHANGE_0</name>
                    <displayName>TABLE_CHANGE_0</displayName>
                    <description>Table Change 0 Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TABLE_VAL_0</name>
                            <description>TABLE_VAL_0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_1</name>
                            <description>TABLE_VAL_1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_02</name>
                            <description>TABLE_VAL_2 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_3</name>
                            <description>TABLE_VAL_3 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="TABLE_CHANGE_0">
                    <name>TABLE_CHANGE_1</name>
                    <displayName>TABLE_CHANGE_1</displayName>
                    <description>Table Change 1 Register</description>
                    <addressOffset>0x00000014</addressOffset>
                </register>
                <register derivedFrom="TABLE_CHANGE_0">
                    <name>TABLE_CHANGE_2</name>
                    <displayName>TABLE_CHANGE_1</displayName>
                    <description>Table Change 2 Register</description>
                    <addressOffset>0x00000018</addressOffset>
                </register>
                <register derivedFrom="TABLE_CHANGE_0">
                    <name>TABLE_CHANGE_3</name>
                    <displayName>TABLE_CHANGE_3</displayName>
                    <description>Table Change 3 Register</description>
                    <addressOffset>0x0000001C</addressOffset>
                </register>
                <register>
                    <name>SETUP</name>
                    <displayName>SETUP</displayName>
                    <description>Setup Register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SET_R_COUNT</name>
                            <description>SET_R_COUNT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CURR_R_COUNT</name>
                            <description>CURR_R_COUNT description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SET_L_DIR</name>
                            <description>SET_L_DIR description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CURR_L_DIR</name>
                            <description>CURR_L_DIR description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
