anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR1206/Eclipse/MDR1206AFI_Template/svd/MDR32F02/MDR32F02_rev1.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>S_BLOCK0</name>
            <description>S_BLOCK0 description</description>
            <groupName>S_BLOCK</groupName>
            <baseAddress>0x60008000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TRANSFORM_0</name>
                    <displayName>TRANSFORM_0</displayName>
                    <description>Transformation Register 1</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_1</name>
                    <displayName>TRANSFORM_1</displayName>
                    <description>Transformation Register 2</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_2</name>
                    <displayName>TRANSFORM_2</displayName>
                    <description>Transformation Register 3</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_3</name>
                    <displayName>TRANSFORM_3</displayName>
                    <description>Transformation Register 4</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_4</name>
                    <displayName>TRANSFORM_4</displayName>
                    <description>Transformation Register 5</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_5</name>
                    <displayName>TRANSFORM_5</displayName>
                    <description>Transformation Register 6</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_6</name>
                    <displayName>TRANSFORM_6</displayName>
                    <description>Transformation Register 7</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_7</name>
                    <displayName>TRANSFORM_7</displayName>
                    <description>Transformation Register 8</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TABLE_CHG</name>
                    <displayName>TABLE_CHG</displayName>
                    <description>Table change register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TABLE_VAL_0</name>
                            <description>TABLE_VAL_0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_1</name>
                            <description>TABLE_VAL_1 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_2</name>
                            <description>TABLE_VAL_2 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>TABLE_VAL_3</name>
                            <description>TABLE_VAL_3 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>M_SCTRL</name>
                    <displayName>M_SCTRL</displayName>
                    <description>Memory special control</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="S_BLOCK0">
            <name>S_BLOCK1</name>
            <description>S_BLOCK1 description</description>
            <groupName>S_BLOCK</groupName>
            <baseAddress>0x6000C000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="S_BLOCK0">
            <name>S_BLOCK2</name>
            <description>S_BLOCK2 description</description>
            <groupName>S_BLOCK2</groupName>
            <baseAddress>0x60010000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="S_BLOCK0">
            <name>S_BLOCK3</name>
            <description>S_BLOCK3 description</description>
            <groupName>S_BLOCK3</groupName>
            <baseAddress>0x60014000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="S_BLOCK0">
            <name>S_BLOCK4</name>
            <description>S_BLOCK4 description</description>
            <groupName>S_BLOCK4</groupName>
            <baseAddress>0x60018000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="S_BLOCK0">
            <name>S_BLOCK5</name>
            <description>S_BLOCK5 description</description>
            <groupName>S_BLOCK5</groupName>
            <baseAddress>0x6001C000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="S_BLOCK0">
            <name>S_BLOCK6</name>
            <description>S_BLOCK6 description</description>
            <groupName>S_BLOCK6</groupName>
            <baseAddress>0x60020000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="S_BLOCK0">
            <name>S_BLOCK7</name>
            <description>S_BLOCK7 description</description>
            <groupName>S_BLOCK7</groupName>
            <baseAddress>0x60024000</baseAddress>
        </peripheral>
        <peripheral>
            <name>P_BYTE</name>
            <description>P_BYTE description</description>
            <groupName>P_BYTE</groupName>
            <baseAddress>0x60028000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TRANSFORM_0</name>
                    <displayName>TRANSFORM_0</displayName>
                    <description>Transformation Register 1</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_1</name>
                    <displayName>TRANSFORM_1</displayName>
                    <description>Transformation Register 2</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_2</name>
                    <displayName>TRANSFORM_2</displayName>
                    <description>Transformation Register 3</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_3</name>
                    <displayName>TRANSFORM_3</displayName>
                    <description>Transformation Register 4</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_4</name>
                    <displayName>TRANSFORM_4</displayName>
                    <description>Transformation Register 5</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_5</name>
                    <displayName>TRANSFORM_5</displayName>
                    <description>Transformation Register 6</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_6</name>
                    <displayName>TRANSFORM_6</displayName>
                    <description>Transformation Register 7</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_7</name>
                    <displayName>TRANSFORM_7</displayName>
                    <description>Transformation Register 8</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_8</name>
                    <displayName>TRANSFORM_8</displayName>
                    <description>Transformation Register 9</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_9</name>
                    <displayName>TRANSFORM_9</displayName>
                    <description>Transformation Register 10</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_10</name>
                    <displayName>TRANSFORM_10</displayName>
                    <description>Transformation Register 11</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_11</name>
                    <displayName>TRANSFORM_11</displayName>
                    <description>Transformation Register 12</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_12</name>
                    <displayName>TRANSFORM_12</displayName>
                    <description>Transformation Register 13</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_13</name>
                    <displayName>TRANSFORM_13</displayName>
                    <description>Transformation Register 14</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_14</name>
                    <displayName>TRANSFORM_14</displayName>
                    <description>Transformation Register 15</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TRANSFORM_15</name>
                    <displayName>TRANSFORM_15</displayName>
                    <description>Transformation Register 16</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>MUX_SET</name>
                    <displayName>MUX_SET</displayName>
                    <description>Transformation setup register</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>IN_SEL</name>
                            <description>IN_SEL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OUT_SEL</name>
                            <description>OUT_SEL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MUX_VAL</name>
                    <displayName>MUX_VAL</displayName>
                    <description>Transformation value register</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>VAL description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SEL</name>
                            <description>SEL description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
